app/controllers/visaos_controller.rb

  def load_professors
    @unidades = Unidade.all
    @professors = Professor.find(:all,:joins => :unidade, :conditions => ["unidades.tipo in (1,2,3)"], :order => "matricula")
---
SELECT * FROM `unidades`
SELECT `professors`.* FROM `professors` INNER JOIN `unidades` ON `unidades`.id = `professors`.sede_id WHERE (unidades.tipo in (1,2,3)) ORDER BY matricula